<?php

use Illuminate\Database\Seeder;
use App\Program;

class ProgramsTableSeeder extends Seeder
{
    public function run()
    {
        $data = [
            [
                'title' => 'Функциональные тренировки',
                'description' => 'Физиологически - естественная работа всех мышечных групп таких как: поднятия ребёнка или тяжелого чемодана, завязывание шнурков, подъем по лестнице и подъем из глубоко приседа. Все движения, которые мы используем каждый день в повседневной жизни. Эти тренировки позволят с легкостью, не задумываясь выполнять их, с комфортом в спине и в других суставах. Они созданы для всех возрастных групп и с любым уровнем физической подготовки. Задействуют мелкие мышцы - стабилизаторы, что развивает правильное мышечно - сбалансированное развитое тело. Позволяет быстро сбросить лишний вес, а ещё помогут создать красивые, упругие ягодницы, прямую спину и высокую грудь. Высоко поднятый подбородок и взгляд направленный вперёд даст вам большую уверенность в себе, станет визитной карточкой успешного человека. Вот, то немногое, что дают вам функциональные тренировки. Правильно подобранная нагрузка «от простого к сложному» не заставит долго ждать, и уже через 6 недель вы увидите устойчивый результат. Мой основной девиз «заканчивать тренировку с чувством не до тренированности» С легкостью и желанием тренироваться, это лучший путь к успеху. Моя программа направлена на развитие всех физических качеств организма, такие как: сила и быстрота, выносливость и гибкость, ловкость и координация. Разнообразие упражнений делает тренировки желанными, без чрезмерного напряжения и доступными без использования специального спортивного оборудования. Удачи и легкости в достижении поставленых целей!',
                'active' => 1
            ],
            [
                'title' => 'Восстановление после родов',
                'description' => 'Рождение ребёнка это огромное счастье для всей семьи, но чаще всего, никто не думает, как тяжело первое время маме. Послеродовая депрессия, бессонные ночи, да и тело не в лучшей форме. Ещё год назад в журнале women’s health я печатала гимнастику для беременных, сейчас на своём примере, мне 45 и моему младшему ребёнку 1 год, хочу показать, как за короткое время, можно восстановить организм физически и эмоционально. Я полна сил и энергии, предлагаю вам, дорогие мамочки, послеродовую гимнастику с элементами фитнеса, которая без чрезмерных, постепенно нарастающих нагрузок, позволит в короткое время физически восстановить организм, сбросить лишний вес, набраться позитивной энергией и поднять «себе - любимой» настроение. Всем известно, что счастливая, улыбающаяся мама - это хороший эмоциональный фон всей семьи!',
                'active' => 1
            ],
            [
                'title' => 'Блок программ 50+',
                'description' => 'Дети выросли и вот наконец прекрасное время заняться собой. Чтобы полноценно жить с хорошим самочувствием и в хорошей физической форме нужно обязательно заниматься фитнесом, оздоровительной ходьбой на свежем воздухе в парке, если есть возможность плавать, следить за питанием и пусть не пугают вас возрастные изменения в организме. Мой девиз «мы состоим из того, что мы едим» все это мы делаем только для себя. Это даст вам заряд бодрости, наполнит вас жизненной энергией, повысит ваш эмоциональный фон. Я предлагаю блок оздоровительных, общеукрепляющих программ, которые помогут справиться с возрастными изменениями в организме. Уже через каких-то 6 недель вы сбросите лишний вес, ускорится метаболизм, ваша походка станет легкой и непринужденной. Издавна наши предки говорили «В ЗДОРОВОМ ТЕЛЕ, ЗДОРОВЫЙ ДУХ» тренировки помогут найти внутренний баланс между душой и телом, вернуть вкус к жизни. Ваш организм наберется силы, разовьётся гибкость в суставах, улучшится координация движений. Сделайте подарок вашему организму, омолодите его через движения.',
                'active' => 1
            ],
            [
                'title' => 'Тренировки на TRX',
                'description' => 'Мной разработан блок программ с использованием специального спортивного оборудования такого как петли TRX. Оно уникально, не занимает много места, можно использовать на улице, дома. Петли TRX не несут опасной осевой нагрузки на позвоночник, упражнения делаются с собственным весом и в подвешенном состоянии. TRX можно зацепить не только за дверь, но и за любой предмет (н.пр. ствол дерева, столб, потолок) можно брать с собой, он очень компактный и легкий. Вы проработаете все группы мышц, улучшите их силу в несколько раз, разовьётся баланс и координация. TRX используют профессиональные спортсмены в разных видах спорта и в реабилитации после травм, а также их профилактики. Программы тренировок становятся более вариативные и разнообразные. Мышцы кора и стабилизаторы задействованы по максимуму, что позволяет сжигать больше калорий и быстрее улучшить физическую форму. Улучшается работа вестибулярного аппарата это позволяет легче и быстрее набирать форму в других видах спорта таких как: горные и беговые лыжи, сёрфинг и роликовые коньки и других где требуется координация. Если вы хотите укрепить мышцы спины и пресса, быстро похудеть, повысить свой функционал и силовые показатели, в этом вам помогут мои программы упражнений на TRX. Пробуйте и идите к своей цели с легкостью и желанием.',
                'active' => 1
            ],
            [
                'title' => 'Блог программ на BOSU',
                'description' => 'Мной разработан блок программ с использование специального спортивного оборудования такого как BOSU. Оно легко доступно в использовании, нестабильная поверхность позволяет прорабатывать все группы мышц, улучшит их силу в несколько раз, развивает баланс и координация. BOSU используют профессиональные спортсмены в разных видах спорта и в реабилитации после травм, а также их профилактики. Программы тренировок становятся более вариативные и разнообразные. Мышцы кора и стабилизаторы задействованы по максимуму, что позволяет сжигать больше калорий и быстрее улучшить физическую форму. Улучшается работа вестибулярного аппарата это позволяет легче и быстрее набирать форму в других видах спорта таких как: горные и беговые лыжи, сёрфинг и роликовые коньки и других где требуется координация. Если вы хотите укрепить мышцы спины и пресса, быстро похудеть, повысить свой функционал и силовые показатели, в этом вам помогут мои программы упражнений на BOSU. Пробуйте и идите к своей цели с легкостью и желанием.',
                'active' => 1
            ],
            [
                'title' => 'Кардио тренировки',
                'description' => 'Естественный вид физической нагрузки доступный для всех. Ходьба, бег, плавание, велосипед не только тренирует главную мышцу организма - сердце, а так же легкие, но и укрепляет организм в целом. Многократное повторение одного и того же упражнения, с низкой и умеренной нагрузкой, позволяет с меньшим усилием добиваться большего результата. Ускорить обмен веществ, сжигать жировую ткань, укрепить иммунитет. Кардио тренировки - это единственный вид физической нагрузки который восстанавливает нейронные связи, позволяет бороться с нарушением сна, повышает уровень эндорфинов в крови (гормона радости) тем самым избавляет от депрессии без лекарств, улучшает работу головного мозга, повышает способность к обучению и улучшает память. А ваше подтянутое тело, стройная фигура, это дополнительный бонус который вы получите благодаря кардио тренировкам.',
                'active' => 1
            ]
        ];


        foreach ($data as $k => $item) {
            $item['photo'] = 'images/programs/program'.($k+1).'.jpg';
            Program::create($item);
        }
    }
}