<?php

return [
    'yes' => 'Да',
    'no' => 'Нет',
    'warning' => 'Внимание!',
    'welcome' => 'Добро пожаловать',
    'admin_page' => 'Админка',
    'home' => 'Главная',
    'privacy_policy' => 'Политика конфиденциальности',
    'you_must_open_this_in_app' => 'Вы должны открыть эту ссылку в приложении MyFit!',
    'users' => 'Пользователи',
    'adding_user' => 'Добавление пользователя',
    'add_user' => 'Добавить пользователя',
    'messages' => 'Сообщения',
    'delete' => 'Удалить',
    'close' => 'Закрыть',
    'confirm_delete_user' => 'Вы действительно хотите удалить этого пользователя?',
    'avatar' => 'Аватар',
    'user_name' => 'Имя пользователя',
    'birthday_year' => 'Год рождения',
    'status' => 'Статус',
];
